app/controllers/item_controller.rb

def add
  @items=Item.all
---
SELECT "items".* FROM "items"

def create
  #@new=Item.create!(params)
  puts "YO OVER HERE _______________________________________________________________"
  puts params[:new][:name]

  @new = Item.create!(:name => params[:new][:name], :price=>params[:new][:price])
---
INSERT INTO "items" ("name", "quantity", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "the dog"], ["quantity", 13], ["description", "stuff"], ["created_at", "2016-08-13 00:34:38.039779"], ["updated_at", "2016-08-13 00:34:38.039779"]]

  def delete
    puts "_______________DELETING THIS STUFF ____________________________________________"

    puts params
    puts "and this is our id thingy"
    puts params[:format]
    @vanish=Item.find_by name: (params[:format])
  @vanish.destroy!
---
SELECT  "items".* FROM "items" WHERE "items"."name" = $1 LIMIT 1  [["name", "the dog"]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]